app/controllers/my/projects_controller.rb

INSERT INTO "projects" ("created_at", "description", "goal", "teaser", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @project = current_user.projects.build params[:project]
    if @project.save