app/controllers/my/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 146 ORDER BY projects.created_at DESC
---
  def index
    @projects = current_user.projects.order('projects.created_at DESC').all

UPDATE "projects" SET "title" = 'It is really my project', "description" = '
---
  def update
    if (current_user.admin == 1)
      if @project.update_attributes params[:project]