app/controllers/users_controller.rb

  def create
  	@user = User.new(params[:user])

  	if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "email", "first_name", "last_name", "salt", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"